tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.2                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
    location    "0.003";
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    minX
    {
        type            fixedValue;
        value           uniform 0.1;
    }
    maxX
    {
        type            zeroGradient;
    }

    minY
    {
        type            zeroGradient;
    }
    maxY
    {
        type            zeroGradient;
    }

    minZ
    {
        type            zeroGradient;
    }
    maxZ
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
